/*2. Написать программу, определяющую, является ли введенное число простым или составным. */

# include <iostream> 
using namespace std;

int main (){
int number; 
cout << "Your Number", cin >> number;
for (i = 0; )







}

// сдаюсь..