/*3. Написать программу, которая находит НОД(наибольший общий делитель) двух целых
чисел, введенных пользователем. */

# include <iostream>

using namespace std; 

int main ()
{

int firstNumber, secondNumber, nod; 

cout << "Please insert your first number ", cin >> firstNumber; 
cout << "Please insert your second number ", cin >> secondNumber; 

for (int i = 0; firstNumber%i=0 && secondNumber%i=0; i++ )

;}